In [57]:
import pandas as pd
import numpy as np

In [59]:
data = [1, 2, 3, 4, 5]
s1 = pd.Series(data)

In [61]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [62]:
frQty = {'apple': 2, 'banana':12, 'orange': 5}

In [65]:
frQtySer = pd.Series(frQty)

In [66]:
frQtySer

apple      2
banana    12
orange     5
dtype: int64

In [68]:
s1[s1<3]

0    1
1    2
dtype: int64

In [70]:
alph = pd.Series(data, index = ['a', 'b', 'c', 'd', 'e'])

In [72]:
alph

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [74]:
alph['e']

5

In [77]:
data[4]

5

In [78]:
frQty['apple']

2

In [81]:
frQty['banana']

12

In [82]:
# frQty[1]
# Can't access elements like that from dictionary to series

In [85]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 27],
    'Place': ['LA', 'NYC', 'Chicago']
}

In [87]:
df = pd.DataFrame(data)

In [89]:
df

      Name  Age    Place
0    Alice   25       LA
1      Bob   30      NYC
2  Charlie   27  Chicago

In [90]:
names = ['A', 'B', 'C']
ages = [1, 2, 3]
places = ['h', 'i', 'j']

In [93]:
df1 = pd.DataFrame({
    'Name': names,
    'Age': ages,
    'Cities': places
})
df1

  Name  Age Cities
0    A    1      h
1    B    2      i
2    C    3      j

In [101]:
arr = np.array([[25, 'NYC'], [30, 'LA']])

In [108]:
df2 = pd.DataFrame(arr, columns=['Age', 'Places'])
df2

  Age Places
0  25    NYC
1  30     LA

In [110]:
names = pd.Series(['Alice', 'Bob', 'Charlie'], name = 'Name')
ages = pd.Series([20, 21, 22], name = 'Age')
dfC = pd.concat([names, ages], axis=1)
dfC

      Name  Age
0    Alice   20
1      Bob   21
2  Charlie   22

In [112]:
d = {
    'name':['A', 'B', 'C'],
    'city':['LA', 'NYC', 'LA']
}

ddf = pd.DataFrame(d)
ddf

  name city
0    A   LA
1    B  NYC
2    C   LA

In [126]:
rd = pd.read_csv('demoPD.csv')
rd

   ID            Name  Math  Science  English
0   1        John Doe    88       92       85
1   2      Jane Smith    94       89       91
2   3     Bob Johnson    78       84       80
3   4  Alice Williams    85       95       89
4   5   Charlie Brown    92       88       84

In [130]:
pd.read_csv('demoPD.csv', usecols=['Name'])

             Name
0        John Doe
1      Jane Smith
2     Bob Johnson
3  Alice Williams
4   Charlie Brown

In [132]:
rd.iloc[1]

ID                  2
Name       Jane Smith
Math               94
Science            89
English            91
Name: 1, dtype: object

In [138]:
d2 = {
    'name':['A', 'B', 'C', 'df', 'dgf', 'dfg', 'tf'],
    'city':['LA', 'NYC', 'LA', 'LA', 'LA', 'LA'],
    'age': [15, 4, 1, 7, 7, 8, 6],
    'marks': [77, 88, 99, 75, 88, 65],
    'bloodGrp': ['A +ve', 'B +ve', 'A +ve', 'A +ve', 'B +ve', 'A +ve', ]
}

In [148]:
studData = pd.read_csv('student.csv')

In [150]:
studData

   Roll No            Name  Class  Marks
0        1        John Doe     10     85
1        2      Jane Smith     10     90
2        3     Bob Johnson      9     78
3        4  Alice Williams     11     88
4        5   Charlie Brown     10     92
5        6      Jane Smith     10     90
6        7     Bob Johnson      9     78
7        8  Alice Williams     11     88
8        9   Charlie Brown     10     92
9       10   Charlie Brown     10     92

In [152]:
studData.head()

   Roll No            Name  Class  Marks
0        1        John Doe     10     85
1        2      Jane Smith     10     90
2        3     Bob Johnson      9     78
3        4  Alice Williams     11     88
4        5   Charlie Brown     10     92

In [154]:
studData.tail()

   Roll No            Name  Class  Marks
5        6      Jane Smith     10     90
6        7     Bob Johnson      9     78
7        8  Alice Williams     11     88
8        9   Charlie Brown     10     92
9       10   Charlie Brown     10     92

In [156]:
studData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Roll No  10 non-null     int64
 1   Name     10 non-null     object
 2   Class    10 non-null     int64
 3   Marks    10 non-null     int64
dtypes: int64(3), object(1)
memory usage: 452.0+ bytes

In [158]:
studData.describe()

        Roll No      Class      Marks
count  10.00000  10.000000  10.000000
mean    5.50000  10.000000  87.300000
std     3.02765   0.666667   5.375872
min     1.00000   9.000000  78.000000
25%     3.25000  10.000000  85.750000
50%     5.50000  10.000000  89.000000
75%     7.75000  10.000000  91.500000
max    10.00000  11.000000  92.000000

In [170]:
rd.dtypes

ID          int64
Name       object
Math        int64
Science     int64
English     int64
dtype: object